Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/educational_supports/non_nationals_and_non_english_speakers.html.txt.tmx
Source language: en
Languages: ga

source: Resources for non-English-speaking pupils
ga: Acmhainní do dhaltaí nach cainteoirí Béarla iad

source: The Department of Education and Skills (DES) provides additional educational resources for pupils who are learning English as an additional language (EAL) in primary and post-primary schools
ga: Soláthraíonn an Roinn Oideachais agus Scileanna acmhainní breise oideachais do dhaltaí atá ag foghlaim Béarla mar theanga bhreise i mbunscoileanna agus in iar-bhunscoileanna

source: Full details of the resources available for EAL support are set out in DES circular 0007/2016 (pdf)
ga: Leagadh amach sonraí na n-acmhainní maidir le tacaíocht teanga Béarla sa Ciorclán an ROS 0007/2016

source: Here is a link to frequently asked questions on Circular 0007/2016 (pdf)
ga: Seo nasc le ceisteanna coitianta ar Ciorclán 0007/2016

source: Under the teacher allocation reforms introduced in 2012, the combined resources available for GAM (General Allocation Model of Learning Support) and EAL were used to create a single allocation process for all primary schools to cover both the GAM and language support
ga: Faoi na leasuithe leithdháilte múinteora a tugadh isteach in 2012, úsáideadh na comhacmhainní a bhí ar fáil don SGL (an tSamhail Ghinearálta Leithdháilte de Thacaíocht Foghlama) agus don EAL chun próiseas singil leithdháilte a chruthú do gach bunscoil chun an SGL agus tacaíocht teanga a chuimsiú

source: Autonomy is given to schools to deploy GAM/EAL hours between learning and language support depending on the specific needs of the school
ga: Tugtar féinriar do scoileanna chun na huaireanta a chaitear leis an SGL/EAl a chaitheamh idir foghlaim agus tacaíocht teanga, ag brath ar riachtanais ar leith na scoile

source: Where at least 20% of the total enrolment of the school is made up of pupils that require EAL support, the Board of Management can lodge an appeal for a review of the proposed allocation for pupils requiring EAL support
ga: Sa chás gur daltaí atá in 20%, ar a laghad, de rollú iomlán na scoile óna dteastaíonn tacaíocht EAL, féadfaidh an Bord Bainistíochta achomharc a sheoladh isteach d’athbhreithniú ar leithdháileadh beartaithe daltaí óna dteastaíonn tacaíocht EAL

source: The National Council for Curriculum and Assessment has Primary and Post-Primary Assessment Kits on its website, which can be used to assess non-English-speaking pupils
ga: Tá tástálacha ar fáil ar shuíomh gréasáin na Comhairle Náisiúnta Curaclaim agus Measúnachta chun inniúlachta teanga Béarla dáltaí bunscoile agus iarbhunscoile a mheasúnú

source: The National Council for Curriculum and Assessment has published the following guidelines for schools: Intercultural Education in the Primary School (pdf) and Intercultural Education in the Post-Primary School (pdf)
ga: D’fhoilsigh an Chomhairle Náisiúnta Curaclaim agus Measúnachta na treoirlínte seo leanas: Intercultural Education in the Primary School (pdf) and Intercultural Education in the Post-Primary School (pdf)

source: The website of the English Language Support Programme has activities related to the Junior Certificate curriculum
ga: Tá gníomhaireachtaí maidir leis an Teastas Sóisearach ar an suíomh gréasáin English Language Support Programme
